IDEA Open Model
CheckResSummary.LoadCaseId Property
Compatible with IDEA StatiCa 20.1
Note: This API is now obsolete.
 Id of Load Case
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
[ObsoleteAttribute]
public int LoadCaseId { get; set; }
<ObsoleteAttribute>
Public Property LoadCaseId As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
CheckResSummary Class
IdeaRS.OpenModel.Connection Namespace